app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "details", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "djhdjdf"], ["details", "fdjkdjd"], ["created_at", "2021-07-24 15:47:59.309410"], ["updated_at", "2021-07-24 15:47:59.309410"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_blog
      @blog = Blog.find(params[:id])